ERP DEV.WMS/src/DataProcessors/ПечатьШтрихкода/ПечатьШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьШтрихкода</name>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектов</name>
    <type>
      <types>TypeDescription</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КодируемыеЗначения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстНадписиСлева</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP DEV.WMS/src/DataProcessors/ПечатьШтрихкода/Forms/Форма/Module.bsl
Функция ПолучитьСписокРеквизитовОбъекта(знач СписокКодируемыхЭлементов)
	
	СписокЗначений = Новый СписокЗначений; 	
	
	ТаблПримитивныхТипов=Новый ТаблицаЗначений;
	ТаблПримитивныхТипов.Колонки.Добавить("Тип");
	НовСтр=ТаблПримитивныхТипов.Добавить();
	НовСтр.Тип="Число";
	НовСтр=ТаблПримитивныхТипов.Добавить();
	НовСтр.Тип="Строка"; 
	ТаблПримитивныхТипов.Индексы.Добавить("Тип"); 
	
	Для каждого Элемент Из СписокКодируемыхЭлементов Цикл
		
		КоллекцияРеквизитов = Элемент.Значение.Метаданные().Реквизиты;
		КоллекцияСтандартныхРеквизитов = Элемент.Значение.Метаданные().СтандартныеРеквизиты;
		
		Для каждого Реквизит Из КоллекцияРеквизитов Цикл		
			Если ТаблПримитивныхТипов.Найти(Строка(Реквизит.Тип)) <> Неопределено Тогда 
				СписокЗначений.Добавить(Реквизит.Имя,Реквизит.Синоним); 
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Реквизит Из КоллекцияСтандартныхРеквизитов Цикл		
			Если ТаблПримитивныхТипов.Найти(Строка(Реквизит.Тип)) <> Неопределено Тогда 
				СписокЗначений.Добавить(Реквизит.Имя,Реквизит.Синоним); 
			КонецЕсли;
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;
	
	СписокЗначений.Добавить("УникальныйИдентификатор()","Уникальный идентификатор");
	
	Возврат СписокЗначений;
	

КонецФункции // ПолучитьСписокРеквизитовОбъекта()

&НаКлиенте
Процедура РеквизитНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.Реквизит.СписокВыбора.Очистить();
	
	СписокКодируемыхРеквизитов = ПолучитьСписокРеквизитовОбъекта(Объект.КодируемыеЗначения);  
	
	Для каждого КлючЗначение Из СписокКодируемыхРеквизитов Цикл		
		Элементы.Реквизит.СписокВыбора.Добавить(КлючЗначение.Значение,КлючЗначение.Представление);			
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Процедура ВывестиШтрихкод(Команда)  
	
	Размеры = Новый Структура("Ширина,Высота",Объект.Ширина,Объект.Высота);
	ПараметрыПечати = Новый Структура("Префикс,РеквизитКодирования,КодируемыеЗначения,Размеры,РазмерШрифта",Объект.Префикс,Объект.Реквизит,Объект.КодируемыеЗначения,Размеры,РазмерШрифта);
	ПараметрыПечати.Вставить("РежимПечати",РежимПечати);
	ПараметрыПечати.Вставить("КоличествоКолонок",КоличествоКолонок);
	ПараметрыПечати.Вставить("КоличествоСтрок",КоличествоСтрок);
	ПараметрыПечати.Вставить("ТипКода",ТипКода);
	ПараметрыПечати.Вставить("Отладка",РежимТехническогоСпециалиста);    
	ПараметрыПечати.Вставить("ВысотаЭтикетки",ВысотаЭтикетки - ЗапасПечати());
	ПараметрыПечати.Вставить("ШиринаЭтикетки",ШиринаЭтикетки - ЗапасПечати());
	//++ Кукушкин Н.С. 02.02.2024
	//При таком условии не возникает исключительная ситуация   
	Если  ПараметрыПечати.РежимПечати = 2 Тогда
		Если ПараметрыПечати.ВысотаЭтикетки < 0 Или ПараметрыПечати.ШиринаЭтикетки < 0  Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Высота и ширина этикетки должны быть больше нуля";
			Сообщение.Сообщить();  
			Возврат;
		КонецЕсли;  
	КонецЕсли;
	//-- Кукушкин Н.С. 02.02.2024
	ТабДок = ВывестиШтрихкодСервер(ПараметрыПечати);
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать();
	КонецЕсли;  
	Закрыть();
КонецПроцедуры  

&НаСервере
Функция ВывестиШтрихкодСервер(ПараметрыПечати)
	пОбъект = РеквизитФормыВЗначение("Объект");
	Возврат пОбъект.ПечатьТонкийКлиент(ПараметрыПечати); 
КонецФункции

&НаКлиенте
Процедура КодируемыеЗначенияПриИзменении(Элемент)
	
	Элементы.Реквизит.СписокВыбора.Очистить();
	
	СписокКодируемыхРеквизитов = ПолучитьСписокРеквизитовОбъекта(Объект.КодируемыеЗначения);  
	
	Для каждого КлючЗначение Из СписокКодируемыхРеквизитов Цикл		
		Элементы.Реквизит.СписокВыбора.Добавить(КлючЗначение.Значение,КлючЗначение.Представление);			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектовПриИзменении(Элемент)
	Если Объект.ТипОбъектов <> Неопределено Тогда  
		Элементы.КодируемыеЗначения.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимПечати = 2;
	КоличествоКолонок = 1;
	КоличествоСтрок = 1;
	ТипКода = 16;
	
	Если Объект.ТипОбъектов <> Неопределено Тогда  
		Элементы.КодируемыеЗначения.ТолькоПросмотр = Ложь;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.КодируемыеЗначения) Тогда
		Элементы.Реквизит.СписокВыбора.Очистить();
		
		СписокКодируемыхРеквизитов = ПолучитьСписокРеквизитовОбъекта(Объект.КодируемыеЗначения);  
		
		Для каждого КлючЗначение Из СписокКодируемыхРеквизитов Цикл		
			Элементы.Реквизит.СписокВыбора.Добавить(КлючЗначение.Значение,КлючЗначение.Представление);			
		КонецЦикла;
	КонецЕсли;  
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ширина) Тогда
		Объект.Ширина = 100;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Высота) Тогда
		Объект.Высота = 100;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РежимПечатиПриИзменении(Элемент)
	
	Если РежимПечати = 1 Тогда
		Элементы.ГруппаПараметрыПринтеров.ТекущаяСтраница = Элементы.ГруппаПараметрыА4;
	Иначе
		Элементы.ГруппаПараметрыПринтеров.ТекущаяСтраница = Элементы.ГруппаПараметрыПринтерЭтикетки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗапасПечати()
	//автоматический запас при печати
	Возврат 1;
КонецФункции
